Repository: MattSugui/Langage-lilianne
Catalog: lilylang/Properties/CoreContent.*.resx
Languages: fr_fr

# ChoiceScreenBody
source: Lilian can either compile a single script or an entire project. Press P to use a project file, or press S to use a single file.
fr_fr: Lilian peut soit compiler une single scripte ou un projet entière. Appuyez P pour utiliser un fichier d'un projet, ou S pour utiliser un single fichier.

# ChoiceScreenChoice1
source: Use a project file
fr_fr: Utiliser un fichier d'un projet

# ChoiceScreenChoice2
source: Use a single file
fr_fr: Utiliser un single fichier

source: days
fr_fr: jours

source: File does not exist!
fr_fr: Le fichier n'existe pas !

source: hours
fr_fr: heures

# Hurrah
source: Lilian has successfully compiled your program. Press any key to continue.
fr_fr: Lilian a réussi en compilation de votre application. Appuyez sur un touche pour continuer.

# HurrahAny
source: []=Continue
fr_fr: []=Continuer

# InputAskVer1
source: Where is the project file?
fr_fr: Où-est le fichier du projet ?

# InputAskVer2
source: Where is the code file?
fr_fr: Où-est le fichier du code ?

# Lamentation1
source: Invalid state for the environment. If you don't know what happened, it's my fault.
fr_fr: Un état incorrect pour l'environnement. Si vous ne savez pas qu'est-il arrivé, c'est mon faut.

# Lamentation10
source: Implementation error. The token '{0}' has an invalid predefined UUID. Leave the UUID field blank for a random one, or reformat your UUID.
fr_fr: Un erreur d'implementation. Le jeton « {0} » a un UUID prédéfini incorrect. Faites le champ d'UUID vidé pour un UUID random, ou reconfigurez votre UUID.

# Lamentation11
source: Implementation error. Something happened.
fr_fr: Un erreur d'implementation. Quelque chose a arrivée.

# Lamentation12
source: Implementation error. The opcode '{0}' does not exist. Did you forget to add the opcode first before using it?
fr_fr: Un erreur d'implementation. L'opcode « {0} » n'existe pas. Avez-vous oublié d'ajouter l'opcode avant le utilisant ?

# Lamentation13
source: Implementation error. The predefined opcode '{0}' does not exist. Please reinstall Lilian, or send a bug report.
fr_fr: Un erreur d'implementation. L'opcode prédéfini « {0} » n'existe pas. Veuillez réinstaller Lilian, ou envoyez-nous un rapport de bogue.

# Lamentation14
source: Implementation error. Right bracket {0} for left bracket {1} does not exist. Did you forget to add the token first before using it?
fr_fr: Un erreur d'implementation. Le bracket au droit « {0} » pour le bracket au gauche « {1} » n'existe pas. Avez-vous oublié d'ajouter le jeton avant le utilisant ?

# Lamentation15
source: Implementation error. The opcode {0} does not exist. Did you forget to assign the operation to there?
fr_fr: Un erreur d'implementation. L'opcode « {0} » n'existe pas. Avez-vous oublié d'attribuer une opération ?

# Lamentation16
source: Implementation error. Sentence {0} has more pointers than the allocated parameters for the associated opcode {1} '{2}'.
fr_fr: Un erreur d'implementation. La phrase « {0} » a trop des pointeurs que les parametres alloués pour l'opcode attribué « {1} : {2} ».

# Lamentation17
source: File operation error. {0}
fr_fr: Un erreur d'opération avec des fichiers. {0}

# Lamentation18
source: File operation error. The archive '{0}' does not exist.
fr_fr: Un erreur d'opération avec des fichiers. L'archive « {0} » n'existe pas.

# Lamentation19
source: File operation error. Cannot export to an archive. This is not your fault; it's ours. Contact us lmao. ({0})
fr_fr: Un erreur d'opération avec des fichiers. Nous ne pouvons pas enregistrer à un archive. Ce n'est pas votre faut ; c'est de notre. Envoyez-nous mdr. ({0})

# Lamentation2
source: Syntax error. A string was never terminated.
fr_fr: Un erreur de syntaxe. Un string est sans fin.

# Lamentation20
source: File operation error. Cannot import from an archive. Either that you're a dumbarse and imported something not in an LPS format or it's our fault. If so, contact us. lMAO. ({0})
fr_fr: Un erreur d'opération avec des fichiers. Nous ne pouvons pas ouvrir d'un archive. trop paresseux d'traduire en français ({0})

# Lamentation21
source: Implementation error. The sentence structure '{0}' does not correspond with any of the available statements.
fr_fr: Un erreur d'implementation. La construction de phrase « {0} » ne correspond pas à tout des phrases disponibles.

# Lamentation22
source: Handshake with Coco failed. {0}
fr_fr: Coco a échouée. {0}

# Lamentation23
source: {0} is an undefined feature in this version. Use a newer version of Lilian.
fr_fr: {0} est une caractéristique inexistante dans cette version du Lilian. Utilisez une version plus nouvelle.

# Lamentation24
source: Stack error. {0}
fr_fr: Un erreur avec la pile. {0}

# Lamentation25
source: {0} does not exist in the current context.
fr_fr: {0} n'existe pas dans ce contexte.

# Lamentation26
source: {0} is not a valid Int32 value.
fr_fr: {0} n'est pas un valeur en Int32.

# Lamentation27
source: Index {0} goes beyond the current stream.
fr_fr: L'index {0} est au-delà le courant.

# Lamentation28
source: Index {0} is in an incorrect format.
fr_fr: L'index {0} est en une forme incorrecte.

# Lamentation29
source: '{0}': cannot be shrunk further.
fr_fr: « {0} » : nous ne pouvons pas le diminuer.

# Lamentation3
source: Syntax error. The pattern '{0}' does not exist in the current context.
fr_fr: Un erreur de syntaxe. Le jetonnisation « {0} » n'existe pas dans ce contexte.

# Lamentation30
source: '{0}': cannot be grown further.
fr_fr: « {0} » : nous ne pouvons pas le agrandir.

# Lamentation31
source: '{0}': cannot shrink a string!
fr_fr: « {0} » : nous ne pouvons pas diminuer un string !

# Lamentation32
source: '{0}': cannot grow a string!
fr_fr: « {0} » : nous ne pouvons pas agrandir un string !

# Lamentation33
source: '{0}': cannot shrink a character!
fr_fr: « {0} » : nous ne pouvons pas diminuer un lettre !

# Lamentation34
source: '{0}': cannot grow a character!
fr_fr: « {0} » : nous ne pouvons pas agrandir un lettre !

# Lamentation35
source: '{0}': cannot shrink whatever this is!
fr_fr: « {0} » : nous ne pouvons pas diminuer ça !

# Lamentation36
source: '{0}': cannot grow whatever this is!
fr_fr: « {0} » : nous ne pouvons pas agrandir ça !

# Lamentation37
source: '{0}': cannot realise this string into an integral value.
fr_fr: « {0} » : nous ne pouvons pas le convertir à un valeur intégrale.

# Lamentation38
source: The following call doesn't lead to anywhere: '{0}'.
fr_fr: Ce appel n'est pas attaché partout : « {0} ».

# Lamentation39
source: Internal error: {0} {1}
fr_fr: Un erreur internel : {0} {1}

# Lamentation4
source: The file '{0}' does not exist.
fr_fr: Le fichier « {0} » n'existe pas.

# Lamentation40
source: I've just got a letter. '{0}'
fr_fr: J'ai un message ! « {0} »

# Lamentation41
source: aYO wat the fuk! Lamentation no. {0} does not exist!!!
fr_fr: aYO qu'est ce merde ! Lamentation no. {0} n'existe pas !!!

# Lamentation42
source: Hi!
fr_fr: Salut !

# Lamentation43
source: Preprocessing error. Invalid build number.
fr_fr: Un erreur en traitement avant la compilation. Numéro du build incorrect.

# Lamentation44
source: Preprocessing error. The project does not use this version of Lilian. Use at least {0}.
fr_fr: Un erreur en traitement avant la compilation. Ceci projet n'utilise pas cette version du Lilian. Utilisez, au minimum, la version {0}.

# Lamentation45
source: Preprocessing error. Unknown directive.
fr_fr: Un erreur en traitement avant la compilation. Commande inconnue.

# Lamentation46
source: Preprocessing error. Unknown symbol '{0}'.
fr_fr: Un erreur en traitement avant la compilation. Symbole inconnue « {0} ».

# Lamentation47
source: Preprocessing error. Cannot redefine the previous 'if' statement.
fr_fr: Un erreur en traitement avant la compilation. Vous ne pouvez pas rédéfinir la phrase d' 'if' avante.

# Lamentation48
source: Preprocessing error. There was no 'if' statement to attach this 'else' statement to.
fr_fr: Un erreur en traitement avant la compilation. Il n'y avait pas une phrase d' 'if' pour attacher à cette phrase d' 'else'.

# Lamentation49
source: Preprocessing error. There was no 'if' statement to attach this 'elseif' statement to.
fr_fr: Un erreur en traitement avant la compilation. Il n'y avait pas une phrase d' 'if' pour attacher à cette phrase d' 'elseif'.

# Lamentation5
source: Implementation error. The token '{0}' does not exist. Did you forget to add the token first before using it?
fr_fr: Un erreur d'implementation. Le jeton « {0} » n'existe pas. Avez-vous oublié d'ajouter le jeton avant le utilisant ?

# Lamentation50
source: Preprocessing error. There was no 'if' statement to terminate.
fr_fr: Un erreur en traitement avant la compilation. Il n'y avait pas une phrase d' 'if' pour finir.

# Lamentation51
source: Preprocessing error. '{0}' already exists. Use 'defifn' if needed.
fr_fr: Un erreur en traitement avant la compilation. « {0} » déjà existé. Utilisez 'defifn' s'il est requis.

# Lamentation52
source: Preprocessing error. '{0}' does not exist. Use 'undefife' if needed.
fr_fr: Un erreur en traitement avant la compilation. « {0} » n'existe pas. Utilisez 'undefife' s'il est requis

# Lamentation53
source: Internal error. There is no more memory to work with on this compilation.
fr_fr: Un erreur internel. Il n'y avait pas plus de memoire pour travailler cette compilation.

# Lamentation54
source: Preprocessing error. '{0}' does not exist.
fr_fr: Un erreur en traitement avant la compilation. « {0} » n'existe pas.

# Lamentation55
source: Preprocessing error. There are references to the following inexistent symbols: {0}.
fr_fr: Un erreur en traitement avant la compilation. Il y a des références aux symboles inexistant(s) : {0}.

# Lamentation56
source: Internal error. For this version of Lilian, you cannot declare types other than the standard 15 .NET types.
fr_fr: Un erreur internel. Dans cette version du Lilian, vous ne pouvez pas utiliser des types qui sont d'autre des 15 types prédéfini dans le .NET.

# Lamentation57
source: Implementation error. The core grammar does not exist. Fall back to assembly syntax, or reinstall Lilian.
fr_fr: Un erreur d'implementation. La grammaire primaire n'existe pas. Réinstallez Lilian.

# Lamentation58
source: Preprocessing error. We do not use dot-directives anymore. Use slash directives or fall back to Lilian 1.1.
fr_fr: Un erreur en traitement avant la compilation. Nous n'utilisons pas plus des ordres qui commencent avec un point. Utilisez des ordres qui commencent avec une barre oblique (/) ou retourner au Lilian 1.1.

# Lamentation59
source: Preprocessing error. Cannot declare a project inside of another.
fr_fr: Un erreur en traitement avant la compilation. Nous ne pouvons pas déclarer un projet dans d'autre.

# Lamentation6
source: Implementation error. The predefined token '{0}' does not exist. Please reinstall Lilian, or send a bug report.
fr_fr: Un erreur d'implementation. Le jeton prédéfini « {0} » n'existe pas. Veuillez réinstaller Lilian, ou envoyez-nous un rapport de bogue.

# Lamentation60
source: Preprocessing error. Another project was already defined.
fr_fr: Un erreur en traitement avant la compilation. Un autre projet est déjà déclaré.

# Lamentation61
source: Preprocessing error. Cannot declare code macros in a project definition.
fr_fr: Un erreur en traitement avant la compilation. Nous ne pouvons pas déclarer un ordre d'alteration de code dans une déclaration de projet.

# Lamentation62
source: Preprocessing error. If you were thinking that the 'include' command adds a code file in that location, you were wrong. Do not use this command outside a project definition.
fr_fr: Un erreur en traitement avant la compilation. Si vous fûtes croyant que l'ordre 'include' ajoute un fichier de code là, vous êtes incorrect. N'utilisez pas cette ordre à l'extérieur d'une définition de projet.

# Lamentation63
source: Preprocessing error. Cannot use this command outside of a project definition.
fr_fr: Un erreur en traitement avant la compilation. Vous ne pouvez pas utiliser cette ordre à l'extérieur d'une déclaration de projet.

# Lamentation64
source: Preprocessing error. Cannot declare a grammar inside of another.
fr_fr: Un erreur en traitement avant la compilation. Nous ne pouvons pas déclarer une grammaire dans d'autre.

# Lamentation65
source: Preprocessing error. Another grammar was already defined.
fr_fr: Un erreur en traitement avant la compilation. Une autre grammaire est déjà déclarée.

# Lamentation66
source: Preprocessing error. Cannot put this command in the current context.
fr_fr: Un erreur en traitement avant la compilation. Vous ne pouvez pas déclarer cette ordre dans cette contexte.

# Lamentation67
source: Invalid type entered for this property. Define this type first, or contact me in the case of the default types.
fr_fr: Ce type, « {0} », qui est référé pour ce champ est invalid. Définez ce type avant le utiliser, ou rappelez-moi s'il est en raison des types par défaut.

# Lamentation7
source: Implementation error. There can be nothing at token {0} because the {1} sentence only has {2}.
fr_fr: Un erreur d'implementation. Il y peut-être rien au jeton {0} en raison que la phrase {1} a seulement {2} jetons.

# Lamentation8
source: Implementation error. Some tokens of the {0} sentence have already been specified.
fr_fr: Un erreur d'implementation. Des jetons certains dans la phrase {0} sont déjà spécifiés.

# Lamentation9
source: Syntax error. The token '{0}' cannot exist in its current position of the {1} sentence.
fr_fr: Un erreur de syntaxe. Le jeton « {0} » ne peut pas être dans cette position dans la phrase {1}.

# LinkingStatus
source: Linking named references...
fr_fr: Connexion des références...

# No
source: Actually, no.
fr_fr: Non...

# OutputAsk
source: Where should be the output?
fr_fr: Où doit-être le résultat ? (Laisser vide pour la location comme défini dans la définition du projet)

# PleaseWait
source: Please wait while Lilian examines your code. This may take several minutes depending on the size of the code.
fr_fr: Veulliez patientier tandis que Lilian examine votre code. Il peut prendre des plusieurs minutes selon la taille du code.

# PleaseWaitFinal
source: Please wait while Lilian finalises the program.
fr_fr: Veulliez patientier tandis que Lilian finalise l'application.

# PreprocessStatus
source: Preprocessing the project...
fr_fr: En train de traitement du project...

# PressAny
source: Press any key to continue.
fr_fr: Appuyez sur un touche pour continuer.

# ProgramName
source: Fonder Lilian Language Environment
fr_fr: Environnement linguistique Fonder Lilian

# PSODFoot
source: Oh dear, I've made quite a mess. Press any key to continue.
fr_fr: Oups, c'est tellement un désordre. Appuyez sur un touche pour continuer.

# PSODHead
source: A problem occurred during execution. Meditation out of balance.
fr_fr: Un problème a arrivé tandis qu'elle fonctionne. La méditation a échouée.

# ReadingStatus
source: Reading
fr_fr: Lecture de

source: remaining.
fr_fr: restante.

# ThisProgIsAsk
source: This programme is asking for a file.
fr_fr: Cette application vous demande pour un fichier.

# TranslationStatus
source: Translating code to intermediate representation
fr_fr: Translation du code à la représentation intermédiate

# WannaRun
source: Do you want to run the program afterwards?
fr_fr: Voulez-vous executer l'application ensuite ?

# WelcomeScreenBody
source: This program will compile a project or script into an executable. Press Enter to continue to next page. Press F3 to exit.
fr_fr: Cette application compilera un projet ou script dans une éxecutable. Appuyez sur Entrer pour continuer à la page suivante. Appuyez sur F3 pour fermer.

# WelcomeScreenChoice1
source: Continue
fr_fr: Continuer

# WelcomeScreenChoice2
source: Exit
fr_fr: Fermer

# WelcomeScreenHeader
source: Welcome to the Lilian environment.
fr_fr: Bienvenue au environnement de Lilian.

# Yes
source: Yes, please!
fr_fr: Oui !
